Cirkyt/Software/nrf51_sdk_v6_1_0_b2ec2e6/nrf51822/Board/nrf6310/s110/ble_app_cscs/mpu9250.c
        /* Disable hardware interrupts. */
        set_int_enable(0);

        /* Enter full-power accel-only mode, no FIFO/DMP. */
        data[0] = 0;
        data[1] = 0;
        data[2] = BIT_STBY_XYZG;
        if (mpu_write_reg(st.reg->user_ctrl, *data))
            goto lp_int_restore;

        /* Set motion threshold. */
        data[0] = thresh_hw;
        if (mpu_write_reg(st.reg->motion_thr, *data))
            goto lp_int_restore;

        /* Set wake frequency. */
        if (lpa_freq == 1)
            data[0] = INV_LPA_1_25HZ;
        else if (lpa_freq == 2)
            data[0] = INV_LPA_2_5HZ;
        else if (lpa_freq <= 5)
            data[0] = INV_LPA_5HZ;
        else if (lpa_freq <= 10)
            data[0] = INV_LPA_10HZ;
        else if (lpa_freq <= 20)
            data[0] = INV_LPA_20HZ;
        else if (lpa_freq <= 40)
            data[0] = INV_LPA_40HZ;
        else if (lpa_freq <= 80)
            data[0] = INV_LPA_80HZ;
        else if (lpa_freq <= 160)
            data[0] = INV_LPA_160HZ;
        else if (lpa_freq <= 320)
            data[0] = INV_LPA_320HZ;
        else
            data[0] = INV_LPA_640HZ;
        if (mpu_write_reg(st.reg->lp_accel_odr, *data))
            goto lp_int_restore;

        /* Enable motion interrupt (MPU6500 version). */
        data[0] = BITS_WOM_EN;
        if (mpu_write_reg(st.reg->accel_intel, *data))
            goto lp_int_restore;

        /* Enable cycle mode. */
        data[0] = BIT_LPA_CYCLE;
        if (mpu_write_reg(st.reg->pwr_mgmt_1, *data))
            goto lp_int_restore;

        /* Enable interrupt. */
        data[0] = BIT_MOT_INT_EN;
        if (mpu_write_reg(st.reg->int_enable, *data))
            goto lp_int_restore;

        st.chip_cfg.int_motion_only = 1;
        return 0;
    } else {
        /* Don't "restore" the previous state if no state has been saved. */
        int ii;
        char *cache_ptr = (char*)&st.chip_cfg.cache;
        for (ii = 0; ii < sizeof(st.chip_cfg.cache); ii++) {
            if (cache_ptr[ii] != 0)
                goto lp_int_restore;
        }
        /* If we reach this point, motion interrupt mode hasn't been used yet. */
        return -1;
    }
lp_int_restore:
    /* Set to invalid values to ensure no I2C writes are skipped. */
    st.chip_cfg.gyro_fsr = 0xFF;
    st.chip_cfg.accel_fsr = 0xFF;
    st.chip_cfg.lpf = 0xFF;
    st.chip_cfg.sample_rate = 0xFFFF;
    st.chip_cfg.sensors = 0xFF;
    st.chip_cfg.fifo_enable = 0xFF;
    st.chip_cfg.clk_src = INV_CLK_PLL;
    mpu_set_sensors(st.chip_cfg.cache.sensors_on);
    mpu_set_gyro_fsr(st.chip_cfg.cache.gyro_fsr);
    mpu_set_accel_fsr(st.chip_cfg.cache.accel_fsr);
    mpu_set_lpf(st.chip_cfg.cache.lpf);
    mpu_set_sample_rate(st.chip_cfg.cache.sample_rate);
    mpu_configure_fifo(st.chip_cfg.cache.fifo_sensors);

    if (st.chip_cfg.cache.dmp_on)
        mpu_set_dmp_state(1);

    /* Disable motion interrupt (MPU6500 version). */
    data[0] = 0;
    if (mpu_write_reg(st.reg->accel_intel, *data))
        goto lp_int_restore;

    st.chip_cfg.int_motion_only = 0;
    return 0;
}

/**
 *  @brief      Turn on MPU hardware.
 *  @param[in]  int_param   Platform-specific parameters to interrupt API.
 *  @return     0 if successful.
 */
int mpu_power_on(struct int_param_s *int_param)
{
    unsigned char data[6];

    /* Reset device. */
    data[0] = BIT_RESET;
    if (mpu_write_reg(st.reg->pwr_mgmt_1, *data))
        return -1;
    nrf_delay_ms(100);
    /* Wake up chip. */
    data[0] = 0x00;
    if (mpu_write_reg(st.reg->pwr_mgmt_1, *data))
    	return -1;

    return(0);
}

int mpu_verify_product_id(void)
{
  uint8_t who_am_i;
  
  if (mpu_read_reg(ADDRESS_WHO_AM_I, &who_am_i, 1))
  {
    if (who_am_i != expected_who_am_i)
    {
      return false;
    }
    else
    {
      return true;
    }
  }
  else
  {
    return false;
  }
}

int mpu_write_reg(uint8_t reg, uint8_t data)
{	
	uint8_t w2_data[2];
	
	w2_data[0] = reg;
	w2_data[1] = data;
  return twi_master_transfer(m_device_address, w2_data, 2, TWI_ISSUE_STOP);	  
}

int mpu_read_reg(uint8_t reg, uint8_t *destination, uint8_t length)
{
  bool transfer_succeeded;
  transfer_succeeded = twi_master_transfer(m_device_address, &reg, 1, TWI_DONT_ISSUE_STOP);
  transfer_succeeded &= twi_master_transfer(m_device_address|TWI_READ_BIT, destination, length, TWI_ISSUE_STOP);
  return transfer_succeeded;
}

/*lint --flb "Leave library region" */ 
